LABEL INSTR OP1,OP2

LABEL INSTR OP1,OP2                                                    -12345678
               OP3                                                      12345678
LABEL INSTR OP4,OP5,                                                   -
               OP6,                                                    -
               OP7                                                      12345678
LABEL INSTR OP8,OP9,                                                   -12345678
               OP10,                                                   -12345678
               OP11                                                     12345678

LABEL INSTR OP12,OP13,                                                 -12346578
               OP14

LABEL INSTR OP1,OP2

LABEL INSTR OP1,OP2                                                             
LABEL INSTR OP1,OP2

LABEL INSTR                                                            -12345678
               OP4,OP5,   REMARKS                                      -12345678
               OP6,    R                                               -12346578
               OP7                                                      12345678

LABEL INSTR OP4,OP5    REMARKS                                         -12345678
               OP6,                                                    -12346578
               OP7                                                      12345678
               

LABEL INSTR OP1,OP2,   REMARKS                                         -12345678
               OP3,OP4,       1                                        -12346578
               OP5,OP6        0                                        -12346578
               OP6,                                                    -12346578
               OP6                                                     -12346578
               OP6                                                    s-12346578
               OP7                                                      12345678

LABEL INSTR OP1,OP2    REMARKS                                         -12345678
               OP3,OP4,       1                                        -12346578
               OP5,OP6                                                 -12346578
               OP6            1                                        -12346578
               OP7                                                      12345678


.L20     MNOTE 4,'Length of block does not exceed 256 (&LBL DSECT), &&CX        
               LEANUP option can be optimized to YES'                           

         AIF   ( NOT ( (('A' LE '&C') AND ('&C' LE 'I'))  OR           X        
                       (('J' LE '&C') AND ('&C' LE 'R'))  OR           X        
                       (('S' LE '&C') AND ('&C' LE 'Z'))  OR           X        
                       ('&C' EQ '$') OR ('&C' EQ '_')     OR           X        
                       ('&C' EQ '#') OR ('&C' EQ '@')                  X        
                     )                                                 X        
               ).NAMERR                                                         
         ZFMT  TEEEDIT+1/12/,'&SECT ',                                 X        
               &SYSLIST(1),&SYSLIST(2),&SYSLIST(3),                    X        
               &SYSLIST(4),&SYSLIST(5),&SYSLIST(6),                    X        
               &SYSLIST(7),&SYSLIST(8),&SYSLIST(9),                    X        
               &SYSLIST(10),&SYSLIST(11),                              X        
               &SYSLIST(12),&SYSLIST(13),                              X        
               &SYSLIST(14),&SYSLIST(15),.                                      