LABEL INSTR      O,                                                    -
               O                           A(GDT)                      -
               O,                                                      -
                                                                       -
               OP1 REMARKS                                             -
               OP1 REMARKS                                             -
               REMARKS 2                                                12345678
.L20     MNOTE ,,'llll'

.L20     MNOTE 4,                                                      X12345678
               '  Length of block does not exceed 256 (&LBL DSECT), &&CX12345678
            LEANUP option can be optimized to YES',OP2OP2OP2OP2OP2O,   -12345678
               REMARK REMARK

.L20     MNOTE 4,                                                      X12345678
               '  Length of block does not exceed 256 (&LBL DSECT), &&CX12345678
        Length of block does not exceed 256 (&LBL DSECT), &&C          X12345678
               LEANUP option can be optimized to YES',OP2OP2OP2OP2OP2O,-12345678
               REMARK REMARK